## 多态（polymorphism）

- 静态多态( 编译时多态 )：函数重载、运算符重载，模板。

C++编 译器根据传递给函数的参数和函数名决定具体要使用哪一个函数，又称为先期联编（early binding）。

- 动态多态（ 运行时多态 ）：虚函数 （ virtual 成员函数 ）

在一些场合下，编译器无法在编译过程中完成联编，必须在程序运行时完成选择，因此编译器必须提供这么一套称为“动态联编”（dynamic binding）的机制，也叫晚期联编（late binding）。 C++通过虚函数来实现动态联编。

### 虚函数

基类中被声明为virtual，并在一个或多个派生类中被重新定义的成员函数。

```c
// 类内部
class 类名{
public:
	virtual 返回类型 函数名(参数表){
    //...
    }
};

//类之外
virtual 返回类型 类名::函数名(参数表){
    //...
}
```

当派生类继承基类的时候，基类的虚函数会被派生类继承，再派生类中，即使不加virtual，也是虚函数。

派生类要对虚函数进行中可根据需重定义，**重定义**的格式有一定的要求：

- 函数名字相同
- 函数的参数列表完全相同 （ 参数的个数、参数的类型、参数的顺序 ）
- 函数的返回类型相同。

![虚函数多态原理图.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1655351565836-1b91be78-006d-4390-942d-f4363829c682.png)

当类中定义了一个虚函数后，会在该类创建的对象的存储布局的开始位置多**有且只有一个虚函数指针 （**`**vfptr**`**）**，该虚函数指针指向了一张虚函数表（每个**虚函数指针**对应一张**虚函数表**），而该虚函数表就像一个数组，表中存放的就是各虚函数的入口地址。

当一个基类中设有虚函数，而一个派生类继承了该基类，并对虚函数进行了重定义，我们称之为覆盖 (override ( C++11 )). 这里的覆盖指的是派生类的虚函数表中相应虚函数的入口地址被**覆盖( 修改了原来指向)**。

虚函数机制被激活的五个条件：（ **充要条件** ）

1. 基类定义了虚函数
1. 派生类重定义、覆盖、重写 虚函数
1. 创建派生类对象
1. 基类的指针 ( 引用 ）指向 ( 绑定 )派生类对象
1. 基类指针( 引用 ) 调用虚函数

```c
#include <iostream>

using std::cout;
using std::endl;

class Base;

class Line {
public:
    virtual void show(Base &base);
};
class Base {
    friend void Line::show(Base &base);

public:
    Base(long base = 0) : _base(base) { cout << "Base(long = 0)" << endl; }

    virtual void print() {
        cout << "Base::print()" << endl;
        cout << "Base::_base = " << _base << endl;
    }

    virtual void display() {}

    ~Base() { cout << "~Base()" << endl; }

private:
    long _base;
};

class Derived : public Base {
public:
    Derived(long base = 0, long derived = 0) : Base(base), _derived(derived) {
        cout << "Derived(long  = 0, long = 0)" << endl;
    }

    /* void print(); */
    void print() override {
        cout << "Derived::print()" << endl;
        cout << "Derived::_derived = " << _derived << endl;
    }

    virtual void display() {}

    ~Derived() { cout << "~Derived()" << endl; }

private:
    long _derived;
};

void func(Base *pbase) {
    pbase->print();  //同一种指令
}
// void func(Base &ref) {
//     ref.print();  //同一种指令
// }
    // cout << endl << endl;
    // func(base);

    // cout << endl;
    // func(derived);

int main(int argc, char **argv) {
    cout << "sizeof(Base) = " << sizeof(Base) << endl;
    cout << "sizeof(Derived) = " << sizeof(Derived) << endl << endl;
    Base base(10);
    Derived derived(22, 33);

    cout << endl << endl;
    // Base *pbase = &base;
    func(&base);

    cout << endl;
    // Base *pbase = &derived;
    func(&derived);

    return 0;
}

/*
sizeof(Base) = 16
sizeof(Derived) = 24

Base(long = 0)
Base(long = 0)
Derived(long  = 0, long = 0)

Base::print()
Base::_base = 10

Derived::print()
Derived::_derived = 33
~Derived()
~Base()
~Base()
*/
```

派生类**重写虚函数后添加**`**override ( C++11 )**` 可以保证参数完全相同，不同则会报错

### 不能被设置为虚函数的函数

1.  普通函数（自由函数、全局函数）是 非成员函数 ：
定义虚函数的主要目的是为了重写达到多态，所以普通函数声明为虚函数没有意义，因此编译器在编译时就绑定了它。
1.  静态成员函数：
   - 发生时机看，静态成员函数调用时机在编译时，而虚函数动态多态在运行时

静态成员函数函数没有this指针
静态成员对于每个类都只有一份代码，所有对象都可以共享这份代码，他不归某一个对象所有，所以它也没有动态绑定的必要。(静态函数发生在编译时，虚函数体现多态发生在运行时)

3.  内联成员函数：
   -  发生时机看，内联成员函数调用时机在编译时，而虚函数动态多态在运行时
   -  内联函数本就是为了减少函数调用的代价( 在编译时直接展开 )，如果将内联函数加上virtual，就失去了内联成员函数的作用。
4.  构造函数：
   -  构造函数发生在编译时，虚函数 动态多态发生在运行时
   -  构造函数不能被继承，而虚函数可以被继承 构造函数不能是虚函数
   -  如果将构造函数定义成虚函数，那么对象都没有产生，无法在对象前的位置设置虚函数指针 ，不能找到虚表，不能调用虚函数。
5.  友元函数：
   - 普通函数作为一个类的友元函数时，并不是这个类的成员函数，不能为虚函数。
   - 一个类的友元函数，在自己类中是可以设置为虚函数的，且此时**可以作为**另一个类的友元函数

### 虚函数的访问

1.  使用指针调用虚函数，可以体现出多态
```c
#include <iostream>

using std::cout;
using std::endl;

class Base;

class Line {
public:
    virtual void show(Base &base);
};
class Base {
    friend void Line::show(Base &base);

public:
    Base(long base = 0) : _base(base) { cout << "Base(long = 0)" << endl; }

    virtual void print() {
        cout << "Base::print()" << endl;
        cout << "Base::_base = " << _base << endl;
    }

    virtual void display() {}

    ~Base() { cout << "~Base()" << endl; }

private:
    long _base;
};

class Derived : public Base {
public:
    Derived(long base = 0, long derived = 0) : Base(base), _derived(derived) {
        cout << "Den(long  = 0, long = 0)" << endl;
    }

    /* void print(); */
    void print() override {
        cout << "Derived::print()" << endl;
        cout << "Derived::_derived = " << _derived << endl;
    }

    virtual void display() {}

    ~Derived() { cout << "~Derived()" << endl; }

private:
    long _derived;
};

void func(Base *pbase) {
    pbase->print();  //同一种指令
}

int main(int argc, char **argv) {
    cout << "sizeof(Base) = " << sizeof(Base) << endl;
    cout << "sizeof(Derived) = " << sizeof(Derived) << endl << endl;
    Base base(10);
    Derived derived(22, 33);

    cout << endl << endl;
    // Base *pbase = &base;
    func(&base);

    cout << endl;
    // Base *pbase = &derived;
    func(&derived);

    return 0;
}

/*
sizeof(Base) = 16
sizeof(Derived) = 24

Base(long = 0)
Base(long = 0)
Den(long  = 0, long = 0)

Base::print()
Base::_base = 10

Derived::print()
Derived::_derived = 33
~Derived()
~Base()
~Base()
*/
```

2.  使用引用调用虚函数，可以体现出多态
```c
#include <iostream>

using std::cout;
using std::endl;

class Base {
public:
    Base(long base = 0) : _base(base) { cout << "Base(long = 0)" << endl; }

    virtual void print() {
        cout << "Base::print()" << endl;
        cout << "Base::_base = " << _base << endl;
    }

    ~Base() { cout << "~Base()" << endl; }

private:
    long _base;
};

class Derived : public Base {
public:
    Derived(long base = 0, long derived = 0) : Base(base), _derived(derived) {
        cout << "Derived(long  = 0, long = 0)" << endl;
    }

    //重定义
    void print() override {
        cout << "Derived::print()" << endl;
        cout << "Derived::_derived = " << _derived << endl;
    }

    ~Derived() { cout << "~Derived()" << endl; }

private:
    long _derived;
};

void func(Base &ref) {
    ref.print();  //同一种指令
}

int main(int argc, char **argv) {
    cout << "sizeof(Base) = " << sizeof(Base) << endl;
    cout << "sizeof(Derived) = " << sizeof(Derived) << endl << endl;
    Base base(10);
    Derived derived(22, 33);

    cout << endl << endl;
    func(base);

    cout << endl;
    func(derived);

    return 0;
}
/*
sizeof(Base) = 16
sizeof(Derived) = 24

Base(long = 0)
Base(long = 0)
Derived(long  = 0, long = 0)

Base::print()
Base::_base = 10

Derived::print()
Derived::_derived = 33
~Derived()
~Base()
~Base()
*/
```

3.  **对象**调用虚函数，**没有**体现多态
```c
#include <iostream>

using std::cout;
using std::endl;

class Base {
public:
    Base(long base = 0) : _base(base) { cout << "Base(long = 0)" << endl; }

    virtual void print() {
        cout << "Base::print()" << endl;
        cout << "Base::_base = " << _base << endl;
    }

    ~Base() { cout << "~Base()" << endl; }

private:
    long _base;
};

class Derived : public Base {
public:
    Derived(long base = 0, long derived = 0) : Base(base), _derived(derived) {
        cout << "Derived(long  = 0, long = 0)" << endl;
    }

    //重定义
    void print() override {
        cout << "Derived::print()" << endl;
        cout << "Derived::_derived = " << _derived << endl;
    }

    ~Derived() { cout << "~Derived()" << endl; }

private:
    long _derived;
};

void func(Base &ref) {
    ref.print();  //同一种指令
}

int main(int argc, char **argv) {
    cout << "sizeof(Base) = " << sizeof(Base) << endl;
    cout << "sizeof(Derived) = " << sizeof(Derived) << endl << endl;
    Base base(10);
    Derived derived(22, 33);

    cout << endl;
    base.print();  //没有体现出多态
    derived.print();

    return 0;
}

/*
sizeof(Base) = 16
sizeof(Derived) = 24

Base(long = 0)
Base(long = 0)
Derived(long  = 0, long = 0)

Base::print()
Base::_base = 10
Derived::print()
Derived::_derived = 33
~Derived()
~Base()
~Base()
*/
```

4.  可以使用**其他成员函数（ this 指针 ）**调用虚函数，可以体现动态多态
```c
#include <iostream>

using std::cout;
using std::endl;

class Base {
public:
    Base(long base = 0) : _base(base) { cout << "Base(long = 0)" << endl; }

    virtual void print() {
        cout << "Base::print()" << endl;
        cout << "Base::_base = " << _base << endl;
    }

    /* Base *pbase1 = &derived; */
    // Base * this = pbase1;
    // Base *this = &derived;
    void func1() {
        this->print();  //可以体现多态的
    }

    void func2() {
        Base::print();  //编译时候确定使用的是基类中的print
    }

    ~Base() { cout << "~Base()" << endl; }

private:
    long _base;
};

class Derived : public Base {
public:
    Derived(long base = 0, long derived = 0) : Base(base), _derived(derived) {
        cout << "Derived(long  = 0, long = 0)" << endl;
    }

    //重定义
    void print() override {
        cout << "Derived::print()" << endl;
        cout << "Derived::_derived = " << _derived << endl;
    }

    ~Derived() { cout << "~Derived()" << endl; }

private:
    long _derived;
};

int main(int argc, char **argv) {
    cout << "sizeof(Base) = " << sizeof(Base) << endl;
    cout << "sizeof(Derived) = " << sizeof(Derived) << endl << endl;
    Base base(10);
    Derived derived(22, 33);

    cout << endl;
    Base *pbase = &base;
    pbase->func1();
    pbase->func2();

    cout << endl << "测试" << endl;
    Base *pbase1 = &derived;
    pbase1->func1();
    pbase1->func2();

    return 0;
}

/*
sizeof(Base) = 16
sizeof(Derived) = 24

Base(long = 0)
Base(long = 0)
Derived(long  = 0, long = 0)

Base::print()
Base::_base = 10
Base::print()
Base::_base = 10

测试
Derived::print()
Derived::_derived = 33
Base::print()
Base::_base = 22
~Derived()
~Base()
~Base()
*/
```

5.  使用构造函数与析构函数调用虚函数，**没有体现多态**

```c
#include <iostream>

using std::cout;
using std::endl;

class Grandpa {
public:
    Grandpa() { cout << "Grandpa()" << endl; }

    ~Grandpa() { cout << "~Grandpa()" << endl; }
    virtual void func1() { cout << "Grandpa::func1()" << endl; }

    virtual void func2() { cout << "Grandpa::func2()" << endl; }
};

class Father : public Grandpa {
public:
    Father() : Grandpa() {
        cout << "Father()" << endl;
        this->func1();  // Father Son
    }

    ~Father() {
        cout << "~Father()" << endl;
        this->func2();  // Father Son
    }

    virtual void func1() { cout << "Father::func1()" << endl; }

    virtual void func2() { cout << "Father::func2()" << endl; }
};

class Son : public Father {
public:
    Son() : Father() { cout << "Son()" << endl; }

    ~Son() { cout << "~Son()" << endl; }

    virtual void func1() { cout << "Son::func1()" << endl; }

    virtual void func2() { cout << "Son::func2()" << endl; }
};

int main(int argc, char **argv) {
    Son son;  //栈对象
    return 0;
}
/*
Grandpa()
Father()
Father::func1() // 执行Son构造、Father构造，Grandpa构造，执行Grandpa函数体、Father函数体(此时没有任何对象)、(在执行Son构造函数函数体前产生son对象)Son函数体
Son()
~Son()  // son对象销毁，自动调用其基类的析构函数销毁
~Father()
Father::func2()
~Grandpa()
*/
```

对象的销毁与析构函数的执行 ( 栈对象等价，堆对象 不等价 )

多态多态的体现必须要有虚函数，但是有虚函数，不一定体现出了动态多态。

作业：

```c
#include <iostream>

using std::cout;
using std::endl;

class A {
public:
    virtual void func(int val = 1) { cout << "A->" << val << endl; }
    virtual void test() { func(); }

private:
    long _a;
};

class B : public A {
public:
    virtual void func(int val = 10) { cout << "B->" << val << endl; }

private:
    long _b;
};

int main(void) {
    B b;
    A *p1 = (A *)&b; // 基类指针指向派生类对象,先使用A参数，然后执行B的函数体
    B *p2 = &b; // 没有体现多态
    p1->func();
    p2->func();

    return 0;
}

/*
B->1
B->10
虚函数 的 函数体在运行时确定( 体现出多态 )，参数列表在编译时就已经确定(不包括默认参数，但默认参数在编译时入栈就已经确定也是)没有体现多态。
*/
```

虚函数 的 **函数体在运行时确定( 体现出多态 )**，参数列表在编译时就已经确定，没有体现多态。

#### 抽象类（ 纯虚函数 ）

声明了该虚函数，但是没有实现，使用 `**= 0**`标识

```c
class 类名 {
public:
	virtual 返回类型 函数名(参数包) = 0;
};

virtual void print() const override
```

9:57  override 没有定义虚函数，会报错 todo

- 只要类中含有一个纯虚函数，该类便为抽象类。一个抽象类只能作为基 类来派生新类，不能创建抽象类的对象。
- 只有在派生类中给出了基类中所有纯虚函数的实现时，该派生类才不再是抽象类。
- 不能创建抽象类的对象，但是可以定义抽象类的指针( 引用 )

抽象类往往是作为接口使用

面向对象的一个设计原则 **开闭原则**：对拓展开发，对修改关闭

#### 抽象类（ 将构造函数设置为protected）

```c
Category &root = Category::getRoot(); // 引用 是因为 不能在类外创建对象
```

#### 虚析构函数 （ 为了解决内存泄漏 ）

当**基类的析构函数**被设置成**虚函数**之后，**派生类的析构函数自动**变成虚函数，认为派生类的虚构函数属于重定义（重写），这是唯一一个**函数名字不同的重写**。

编译器对于任何一个类而言，析构函数只有一个，是唯一的。编译器就将析构函数改名为`**destructor**`    ( `pbase -> _destructor() ;` )

#### 重载、 覆盖、 隐藏

重载：发生在**同一个作用域**中，函数名称相同，但参数的类型、个数、顺序不同（参数列表不一样）。

覆盖（重定义、重写）：发生在**基类与派生类中**，同名**虚函数**，参数列表亦完全相同。

隐藏：发生在**基类与派生类中**，指的是在某些情况下，派生类中的**函数（虚函数、非虚函数）屏蔽**了基类中的**同名**函数。(同名 数据成员也有隐藏）

_覆盖_ 是  虚函数同名且参数列表和返回值完全相同的  特殊的_隐藏_

#### 虚表的存在

```c
&对象    	   		  // 对象地址，vfptr地址
(long *)&对象    	   // 对象地址，vfptr地址
(long *)*  (long *)&对象 	   // 虚表地址
(long *)*  (long *)*  (long *)& 对象 // 虚函数入口地址(函数体)
```

虚表是存在的，就普通单继承而言，虚表只有一个，存在于**只读段**

### 五、虚表的存在
```cpp
#include <iostream>

using std::cout;
using std::endl;

class Base {
public:
    Base(long base = 0)
        : _base(base) {
        cout << "Base(long = 0)" << endl;
    }

    virtual void f() {
        cout << "Base::f()" << endl;
    }

    virtual void g() {
        cout << "Base::g()" << endl;
    }

    virtual void h() {
        cout << "Base::h()" << endl;
    }

    ~Base() {
        cout << "~Base()" << endl;
    }

private:
    long _base;
};

class Derived
    : public Base {
public:
    Derived(long base = 0, long derived = 0)
        : Base(base), _derived(derived) {
        cout << "Derived(long  = 0, long = 0)" << endl;
    }

    virtual void f() {
        cout << "Derived::f()" << endl;
    }

    virtual void g() {
        cout << "Derived::g()" << endl;
    }

    virtual void h() {
        cout << "Derived::h()" << endl;
    }

    ~Derived() {
        cout << "~Derived()" << endl;
    }

private:
    long _derived;
};

void test() {
    //虚表是存在的,普通单继承而言，虚表只有一个,虚表存在只读段
    Derived derived(10, 20);                   //栈对象
    printf("Derived的地址 : %p\n", &derived);  //取地址
    /* printf("Derived的地址 : %p\n", **&derived);//取地址 */
    printf("Derived的地址 : %p\n", (long *)&derived);
    printf("虚表的地址 : %p\n", (long *)*(long *)&derived);
    printf("第一个虚函数的地址 : %p\n",
           (long *)*(long *)*(long *)&derived);

    cout << endl
         << endl;
    typedef void (*Function)();  //函数指针
    Function f = (Function) * ((long *)*(long *)&derived);
    f();
    printf("第一个虚函数的入口地址: %p\n", f);

    cout << endl;
    f = (Function) * ((long *)*(long *)&derived + 1);
    f();
    printf("第二个虚函数的入口地址: %p\n", f);

    cout << endl;
    f = (Function) * ((long *)*(long *)&derived + 2);
    f();
    printf("第三个虚函数的入口地址: %p\n", f);

    cout << endl
         << endl;
    Derived derived2(100, 200);                  //栈对象
    printf("derived2的地址 : %p\n", &derived2);  //取地址
    printf("derived2的地址 : %p\n", (long *)&derived2);
    printf("虚表的地址 : %p\n", (long *)*(long *)&derived2);
    printf("第一个虚函数的地址 : %p\n",
           (long *)*(long *)*(long *)&derived2);

    cout << endl
         << "打印数据成员的值" << endl;
    cout << "_base的值 = " << (long)*((long *)&derived + 1) << endl;
    cout << "_derived的值 = " << (long)*((long *)&derived + 2) << endl;
}
int main(int argc, char **argv) {
    test();
    return 0;
}

```

```c
Base(long = 0)
Derived(long  = 0, long = 0)
Derived的地址 : 0x7fff28d10e60
Derived的地址 : 0x7fff28d10e60

derived2的地址 : 0x7fff28d10e80
derived2的地址 : 0x7fff28d10e80

虚表的地址 : 0x55f3486b2d00
虚表的地址 : 0x55f3486b2d00

第一个虚函数的地址 : 0x55f3484b20ea
第一个虚函数的地址 : 0x55f3484b20ea

Derived::f()
第一个虚函数的入口地址: 0x55f3484b20ea

Derived::g()
第二个虚函数的入口地址: 0x55f3484b2122

Derived::h()
第三个虚函数的入口地址: 0x55f3484b215a

Base(long = 0)
Derived(long  = 0, long = 0)
derived2的地址 : 0x7fff28d10e80
derived2的地址 : 0x7fff28d10e80
虚表的地址 : 0x55f3486b2d00
第一个虚函数的地址 : 0x55f3484b20ea
~Derived()
~Base()
~Derived()
~Base()
```

### 多基派生的二义性

如何验证一个函数是不是虚函数？
可以再继续的写一个派生类，让其继承，并将该函数重新在派生类中实现一次。
```cpp
#include <iostream>

using std::cout;
using std::endl;

class A {
public:
    virtual void a() {
        cout << "A::a()" << endl;
    }

    virtual void b() {
        cout << "A::b()" << endl;
    }

    virtual void c() {
        cout << "A::c()" << endl;
    }
};

class B {
public:
    virtual void a() {
        cout << "B::a()" << endl;
    }

    virtual void b() {
        cout << "B::b()" << endl;
    }

    void c() {
        cout << "B::c()" << endl;
    }

    void d() {
        cout << "B::d()" << endl;
    }
};

class C
    : public A,
      public B {
public:
    virtual void a() {
        cout << "C::a()" << endl;
    }

    void c() {
        cout << "C::c()" << endl;
    }

    void d() {
        cout << "C::d()" << endl;
    }
};

class D
    : public C {
public:
    void c() {
        cout << "D::c()" << endl;
    }
};
void test() {
    cout << "sizeof(A) = " << sizeof(A) << endl;
    cout << "sizeof(B) = " << sizeof(B) << endl;
    cout << "sizeof(C) = " << sizeof(C) << endl
         << endl;

    C c;  //栈对象
    printf("&c : %p\n", &c);

    cout << endl;
    A *pa = &c;
    printf("pa : %p\n", pa);
    pa->a();  // C::a
    pa->b();  // A::b
    pa->c();  // C::c

    cout << endl;
    B *pb = &c;
    printf("pb : %p\n", pb);
    pb->a();  // C::a
    pb->b();  // B::b
    pb->c();  //
    pb->d();

    cout << endl;
    C *pc = &c;
    printf("pc : %p\n", pc);
    pc->a();
    /* pc->b();//二义性 */
    pc->A::b();
    pc->B::b();
    pc->c();
    pc->d();  //隐藏

    cout << endl;
    D d;
    pc = &d;
    pc->c();
}
int main(int argc, char **argv) {
    test();
    return 0;
}
```

```c
1>B::$vbtable@:
1> 0	| 0      //虚基指针距离派生类对象首地址的偏移信息
1> 1	| 8 (Bd(B+0)A)  //虚基指针距离虚基类的偏移值
```

## 继承多态的内存布局
```bash
以下测试都是基于VS，X86环境(32bit)。。

注意：虚基指针指向虚基类，虚函数指针指向虚表。。
Linux与vs的唯一区别是，在Linux下虚函数指针与虚基指针合并了

项目->(右键)属性->配置属性->C/C++->命令行
/d1 reportSingleClassLayoutXXX 或者/d1 reportAllClassLayout

测试一、虚继承与继承的区别
//	１.　多了一个虚基指针
//	２.　虚基类子对象位于派生类存储空间的最末尾(先存不变的后存共享的)

1.1、单个继承，不带虚函数
4/8
1>class B	size(8):
1>	+---
1> 0	| +--- (base class A)
1> 0	| | _ia
1>	| +---
1> 4	| _ib

1.2、单个虚继承，不带虚函数
4/12
1>class B	size(12):
1>	+---
1> 0	| {vbptr}
1> 4	| _ib
1>	+---
1>	+--- (virtual base A)
1> 8	| _ia
1>	+---
1>B::$vbtable@:
1> 0	| 0
1> 1	| 8 (Bd(B+0)A)
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>           A       8       0       4     0

测试二：单个虚继承，带虚函数
//   1.如果派生类没有自己新增的虚函数，此时派生类对象不会产生虚函数指针
//   2.如果派生类拥有自己新增的虚函数，此时派生类对象就会产生自己本身的
//    虚函数指针(指向新增的虚函数)，并且该虚函数指针位于派生类对象存储空间的开始位置
2.1、单个继承，带虚函数(派生类没有新增，只有继承或重写)
8/12
1>class B	size(12):
1>	+---
1> 0	| +--- (base class A)
1> 0	| | {vfptr}
1> 4	| | _ia
1>	| +---
1> 8	| _ib
1>	+---
1>B::$vftable@:
1>	| &B_meta
1>	|  0
1> 0	| &B::f

2.2、单个继承，带虚函数(派生类新增了虚函数)
8/12
>class B	size(12):
1>	+---
1> 0	| +--- (base class A)
1> 0	| | {vfptr}
1> 4	| | _ia
1>	| +---
1> 8	| _ib
1>	+---
1>B::$vftable@:
1>	| &B_meta
1>	|  0
1> 0	| &B::f
1> 1	| &B::fb2
总结：针对2.1、2.2，普通继承，派生类新增虚函数直接放在基类虚表中；且基类布局在前面

2.3、单个虚继承，带虚函数(派生类没有新增，只有继承或重写)
8/16
1>class B	size(16):
1>	+---
1> 0	| {vbptr}    //有虚继承的时候就多一个虚基指针，虚基指针指向虚基表
1> 4	| _ib        //有虚函数的时候就产生一个虚函数指针，虚函数指针指向虚函数表
1>	+---
1>	+--- (virtual base A)
1> 8	| {vfptr}
1>12	| _ia
1>	+---
1>B::$vbtable@:
1> 0	| 0
1> 1	| 8 (Bd(B+0)A)
1>B::$vftable@:
1>	| -8
1> 0	| &B::f

2.4、单个虚继承，带虚函数(派生类新增虚函数)
8/20
1>class B	size(20):
1>	+---
1> 0	| {vfptr}
1> 4	| {vbptr}
1> 8	| _ib
1>	+---
1>	+--- (virtual base A)
1>12	| {vfptr}
1>16	| _ia
1>	+---
1>B::$vftable@B@:
1>	| &B_meta
1>	|  0
1> 0	| &B::fb2
1>B::$vbtable@:
1> 0	| -4
1> 1	| 8 (Bd(B+4)A)
1>B::$vftable@A@:
1>	| -12
1> 0	| &B::f
总结：2.3、2.4、虚继承多一个虚基指针，如果派生类新增虚函数，则放在最前面；且基类布局放在最后面

// 测试三：多重继承（带虚函数）
// １、每个基类都有自己的虚函数表
// ２、派生类如果有自己新增的虚函数，会被加入到第一个虚函数表之中
// ３、内存布局中,其基类的布局按照基类被继承时的顺序进行排列
// ４、派生类会覆盖基类的虚函数，只有第一个虚函数表中存放的是真实的被覆盖的虚函数的地址；
//     其它的虚函数表中存放的并不是真实的对应的虚函数的地址，而只是一条跳转指令

3.1、普通多重继承，带虚函数，自己有新增虚函数
28
1>class Derived	size(28):
1>	+---
1> 0	| +--- (base class Base1)
1> 0	| | {vfptr}
1> 4	| | _iBase1
1>	| +---
1> 8	| +--- (base class Base2)
1> 8	| | {vfptr}
1>12	| | _iBase2
1>	| +---
1>16	| +--- (base class Base3)
1>16	| | {vfptr}
1>20	| | _iBase3
1>	| +---
1>24	| _iDerived
1>	+---
1>Derived::$vftable@Base1@:
1>	| &Derived_meta
1>	|  0
1> 0	| &Derived::f(虚函数的覆盖)
1> 1	| &Base1::g
1> 2	| &Base1::h
1> 3	| &Derived::g1(新的虚函数，直接放在基类之后，加快查找速度)
1>Derived::$vftable@Base2@:
1>	| -8
1> 0	| &thunk: this-=8; goto Derived::f   //虚函数表还可以存放跳转指令
1> 1	| &Base2::g
1> 2	| &Base2::h
1>Derived::$vftable@Base3@:
1>	| -16
1> 0	| &thunk: this-=16; goto Derived::f
1> 1	| &Base3::g
1> 2	| &Base3::h

3.2、虚拟多重继承，带虚函数，自己有新增虚函数(只有第一个是虚继承)
32
1>class Derived	size(32):
1>	+---
1> 0	| +--- (base class Base2)
1> 0	| | {vfptr}
1> 4	| | _iBase2
1>	| +---
1> 8	| +--- (base class Base3)
1> 8	| | {vfptr}
1>12	| | _iBase3
1>	| +---
1>16	| {vbptr}
1>20	| _iDerived
1>	+---
1>	+--- (virtual base Base1)
1>24	| {vfptr}
1>28	| _iBase1
1>	+---
1>Derived::$vftable@Base2@:
1>	| &Derived_meta
1>	|  0
1> 0	| &Derived::f
1> 1	| &Base2::g
1> 2	| &Base2::h
1> 3	| &Derived::g1
1>Derived::$vftable@Base3@:
1>	| -8
1> 0	| &thunk: this-=8; goto Derived::f
1> 1	| &Base3::g
1> 2	| &Base3::h
1>Derived::$vbtable@:
1> 0	| -16
1> 1	| 8 (Derivedd(Derived+16)Base1)
1>Derived::$vftable@Base1@:
1>	| -24
1> 0	| &thunk: this-=24; goto Derived::f
1> 1	| &Base1::g
1> 2	| &Base1::h

3.3、虚拟多重继承，带虚函数，自己有新增虚函数(三个都是虚继承)
36
1>class Derived	size(36):
1>	+---
1> 0	| {vfptr}   //以空间换时间
1> 4	| {vbptr}
1> 8	| _iDerived
1>	+---
1>	+--- (virtual base Base1)
1>12	| {vfptr}
1>16	| _iBase1
1>	+---
1>	+--- (virtual base Base2)
1>20	| {vfptr}
1>24	| _iBase2
1>	+---
1>	+--- (virtual base Base3)
1>28	| {vfptr}
1>32	| _iBase3
1>	+---
1>Derived::$vftable@Derived@:
1>	| &Derived_meta
1>	|  0
1> 0	| &Derived::g1
1>Derived::$vbtable@:
1> 0	| -4
1> 1	| 8 (Derivedd(Derived+4)Base1)
1> 2	| 16 (Derivedd(Derived+4)Base2)
1> 3	| 24 (Derivedd(Derived+4)Base3)
1>Derived::$vftable@Base1@:
1>	| -12
1> 0	| &Derived::f
1> 1	| &Base1::g
1> 2	| &Base1::h
1>Derived::$vftable@Base2@:
1>	| -20
1> 0	| &thunk: this-=8; goto Derived::f
1> 1	| &Base2::g
1> 2	| &Base2::h
1>Derived::$vftable@Base3@:
1>	| -28
1> 0	| &thunk: this-=16; goto Derived::f
1> 1	| &Base3::g
1> 2	| &Base3::h

// 测试四：菱形虚继承

//虚基指针所指向的虚基表的内容：
//	1. 虚基指针的第一条内容表示的是该虚基指针距离所在的子对象的首地址的偏移
//	2. 虚基指针的第二条内容表示的是该虚基指针距离虚基类子对象的首地址的偏移
4.1、菱形普通继承(存储二义性)
48
class D	size(48):
1>	+---
1> 0	| +--- (base class B1)
1> 0	| | +--- (base class B)
1> 0	| | | {vfptr}
1> 4	| | | _ib
1> 8	| | | _cb  //1
1>  	| | | <alignment member> (size=3) //内存对齐
1>	| | +---
1>12	| | _ib1
1>16	| | _cb1
1>  	| | <alignment member> (size=3)
1>	| +---
1>20	| +--- (base class B2)
1>20	| | +--- (base class B)
1>20	| | | {vfptr}
1>24	| | | _ib
1>28	| | | _cb
1>  	| | | <alignment member> (size=3)
1>	| | +---
1>32	| | _ib2
1>36	| | _cb2
1>  	| | <alignment member> (size=3)
1>	| +---
1>40	| _id
1>44	| _cd
1>  	| <alignment member> (size=3)
1>	+---
1>D::$vftable@B1@:
1>	| &D_meta
1>	|  0
1> 0	| &D::f
1> 1	| &B::Bf
1> 2	| &D::f1
1> 3	| &B1::Bf1
1> 4	| &D::Df
1>D::$vftable@B2@:
1>	| -20
1> 0	| &thunk: this-=20; goto D::f
1> 1	| &B::Bf
1> 2	| &D::f2
1> 3	| &B2::Bf2

4.2、菱形虚拟继承
52
1>class D	size(52):
1>	+---
1> 0	| +--- (base class B1)
1> 0	| | {vfptr}
1> 4	| | {vbptr}
1> 8	| | _ib1
1>12	| | _cb1
1>  	| | <alignment member> (size=3)
1>	| +---
1>16	| +--- (base class B2)
1>16	| | {vfptr}
1>20	| | {vbptr}
1>24	| | _ib2
1>28	| | _cb2
1>  	| | <alignment member> (size=3)
1>	| +---
1>32	| _id
1>36	| _cd
1>  	| <alignment member> (size=3)
1>	+---
1>	+--- (virtual base B)
1>40	| {vfptr}
1>44	| _ib
1>48	| _cb
1>  	| <alignment member> (size=3)
1>	+---
1>D::$vftable@B1@:
1>	| &D_meta
1>	|  0
1> 0	| &D::f1
1> 1	| &B1::Bf1
1> 2	| &D::Df
1>D::$vftable@B2@:
1>	| -16
1> 0	| &D::f2
1> 1	| &B2::Bf2
1>D::$vbtable@B1@:
1> 0	| -4
1> 1	| 36 (Dd(B1+4)B)
1>D::$vbtable@B2@:
1> 0	| -4
1> 1	| 20 (Dd(B2+4)B)
1>D::$vftable@B@:
1>	| -40
1> 0	| &D::f
1> 1	| &B::Bf

```

#### 1、普通继承与虚拟继承的区别？
虚拟继承会多一个**虚基指针**，虚基指针指向虚基表，虚基表中存放的是虚基指针距离派生类对象首地址的偏移信息，以及虚基指针距离虚基类的偏移信息；此时派生类对象的数据成员存放在基类数据成员的前面
![image-20220528095353592.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570676731-bacad276-7457-4cf4-aa95-b39d95b17482.png)

#### 2、普通继承的时候，派生类有新增虚函数？
![image-20220528095750787.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570689148-39346eba-8117-4aed-995a-4cce1d23d78f.png)

![image-20220528100223445.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570712419-b8704450-a8ec-461c-b0a5-c58129718fa3.png)

#### 3、虚拟继承，基类带虚函数，派生有新增虚函数
![image-20220528100750741.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1655351044007-078a542d-bbc2-42c5-96c2-47c704b13189.png)

![image-20220528100902529.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1655351052976-2df6a243-912f-4bd4-9ed3-64d11938f9c4.png)

总结：有虚函数就会有虚函数指针，有虚拟继承就会有虚基指针，虚函数指针指向虚函数表，虚基指针指向虚基表。

如果是**普通继承**的话，**基类的布局形式**会存在派生类对象的**前面**，派生类的布局形式就会排在后面。如果派生类自己新增虚函数，对派生对象的大小是没有影响的，新增虚函数只会存在之前的虚表中。

如果是**虚拟继承**的话，**派生类的布局**形式会在派生类对象的**前面**，基类的布局形式在后面。如果派生类有**新增虚函数**，**派生类对象的大小会发生变化**，会多产生一个虚函数指针，用来存放新的虚函数的入口地址。

普通继承：（vfptr） 基类   |    派生类

虚拟继承： vfptr(派生类有新增才有此项 以空间换时间) **vbptr**  派生类  |  vfptr 基类

#### 4、普通多继承
![image-20220528102512029.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570768417-297da8aa-49d7-4461-86be-fa305ef638c4.png)

![image-20220528102552197.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1655351126938-a65b5241-bf43-4f73-b5d7-f3c17afc4ea8.png)

#### 5、棱形继承

存在的存储二义性的问题
![image-20220528112015908.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570798453-65029adf-f9f4-47fa-9d13-c317500084d9.png)

虚拟继承解决棱形继承产生的存储二义性问题
![image-20220528113402719.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570802579-1c76236e-cc8e-4955-94e5-7efd4cb283dd.png)

![image-20220528113456647.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570808850-d81fe2ff-b3e8-4e8e-af4d-0a120d2bb71d.png)

### 三、虚拟继承
虚拟继承与虚函数中的virtual的关系，二者都表示**存在、间接、共享**

#### 虚函数中的虚
1、虚函数是存在的
2、虚函数必须要通过一种间接的运行时（而不是编译时）机制才能够激活（调用）的函数（虚表）
3、共享性表现在基类会共享被派生类重定义后的虚函数

#### 虚拟继承中的虚
1、存在即表示虚继承体系和虚基类确实存在
2、间接性表现在当访问虚基类的成员时同样也必须通过某种间接机制来完成（通过虚基表来完成）
3、共享性表现在虚基类会在虚继承体系中被共享，而不会出现多份拷贝（最终的派生类负责虚基类的数据成员的初始化）

![image-20220528120908627.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1654570814365-b83d9799-c363-4e20-a849-037199625c62.png)

![image-20220528120943775.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1655351351225-12dc0379-bf01-4b1b-a7ac-804e6137c15f.png)

![image-20220528121020275.png](https://cdn.nlark.com/yuque/0/2022/png/916648/1655351309230-6ecb433c-a3cb-43af-aec9-b9a6bb3e2189.png)

#### 虚基继承的形式
```c
class Derived
: virtual public/protected/private Base{
  //
};
```

```c
#include <iostream>

using std::cout;
using std::endl;

class A {
public:
    A() { cout << "A()" << endl; }

    A(int ia) : _ia(ia) { cout << "A(int)" << endl; }

protected:
    int _ia;
};

class B : virtual public A {
public:
    B() { cout << "B()" << endl; }

    //派生类B并不负责虚基类A的数据成员的初始化
    B(int ia, int ib) : A(ia), _ib(ib) { cout << "B(int, int)" << endl; }

protected:
    int _ib;
};

class C : public B {
public:
    C(int ia, int ib, int ic) : A(ia), B(ia, ib), _ic(ic) {
        cout << "C(int, int, int)" << endl;
    }

    void show() const {
        cout << "_ia = " << _ia << endl
             << "_ib = " << _ib << endl
             << "_ic = " << _ic << endl;
    }

protected:
    int _ic;
};
int main(int argc, char **argv) {
    C c(10, 20, 30);
    c.show();

    return 0;
}
```

虚基类不会出现多次拷贝，只拷贝一份，因此需要**最后的派生类中**进行**初始化**
